Лабораторная работа 4 

Тема: Ввод-вывод и работа с файлами в языке C 

Цель работы: освоить работу с файлами, открытие и закрытие потоков, чтение и запись 
текстовых и бинарных данных, форматированный ввод-вывод, перемещение по файлу.

Задание 1. Открытие и закрытие файла 
Задачи: 
1. Открыть файл "test.txt" в режиме записи  
2. Проверить, что файл успешно открылся  
3. Вывести сообщение об ошибке при неудаче  
4. Закрыть файл 

Задание 2. Посимвольная запись и чтение 
Задачи: 
1. Записать в файл несколько символов с помощью putc  
2. Закрыть файл  
3. Открыть файл для чтения  
4. Считать файл посимвольно с помощью getc  
5. Вывести содержимое на экран  

Задание 3. Работа со строками 
Задачи: 
1. Записать несколько строк в файл с помощью fputs  
2. Открыть файл для чтения  
3. Считать строки с помощью fgets  
4. Вывести их на экран  

Задание 4. Форматированный ввод-вывод в файл 
Задачи: 
1. Записать в файл несколько чисел и строк с помощью fprintf  
2. Закрыть файл  
3. Открыть файл для чтения  
4. Считать данные с помощью fscanf  
5. Вывести считанные значения  

Задание 5. Ввод с клавиатуры и запись в файл 
Задачи: 
1. Считать строку с клавиатуры с помощью fgets  
2. Записать её в файл  
3. Вывести содержимое файла на экран  

Задание 6. Бинарные файлы (простые данные) 
Задачи: 
1. Создать массив целых чисел  
2. Записать его в бинарный файл с помощью fwrite  
3. Считать массив обратно с помощью fread  
4. Вывести данные  

Задание 7. Работа со структурами в бинарных файлах 
Создать структуру Person: 
• имя  
• возраст  
Задачи: 
1. Создать одну структуру  
2. Записать её в файл  
3. Считать обратно  
4. Вывести данные  

Задание 8. Массив структур 
Задачи: 
1. Создать массив структур Person  
2. Записать массив в бинарный файл  
3. Считать массив обратно  
4. Вывести все элементы  

Задание 9. Позиционирование в файле 
Задачи: 
1. Открыть файл  
2. Переместиться к заданной позиции с помощью fseek  
3. Считать данные начиная с этой позиции  
4. Вывести результат  

Задание 10. Размер файла 
Задачи: 
1. Открыть файл  
2. Определить размер файла с помощью fseek и ftell  
3. Вывести размер  

Задание 11. Проверка конца файла и ошибок 
Задачи: 
1. Читать файл до конца  
2. Проверить достижение конца файла с помощью feof  
3. Проверить наличие ошибок с помощью ferror  

Задание 12.  
Реализовать простую файловую базу людей 
Структура Person: 
• имя  
• возраст  
Задачи: 
1. Ввод данных с клавиатуры  
2. Запись данных в бинарный файл  
3. Чтение всех записей из файла  
4. Вывод на экран  
5. Использовать fread и fwrite  
6. Проверять открытие файла  
7. Закрывать файл после работы








Ответы на вопросы:





1. Что такое файл в языке C

Файл в языке C — это просто набор данных, который хранится на диске. Программа может читать данные из файла или записывать в него. Без файлов вся информация живёт только в оперативной памяти и исчезает при выключении компьютера. Файлы позволяют сохранять данные надолго.



2. Что такое FILE*

FILE* — это указатель на структуру, в которой операционная система хранит всю информацию об открытом файле: где он находится, на каком месте мы сейчас читаем, в каком режиме открыт и т.д. Когда мы открываем файл, функция fopen возвращает этот указатель, и потом мы передаём его во все другие функции, чтобы они знали, с каким именно файлом работать.



3. Какие режимы открытия файла существуют
Основные режимы:

"r" — открыть существующий файл для чтения (файл должен существовать)

"w" — создать новый файл для записи (если файл был, его содержимое сотрётся)

"a" — открыть файл для добавления в конец (данные не стираются, новая запись добавляется в конец)

"r+" — открыть для чтения и записи (файл должен существовать)

"w+" — создать для чтения и записи (старое содержимое стирается)

"a+" — открыть для чтения и добавления в конец

К этим режимам можно добавить букву b (например, "rb", "wb") — это означает бинарный режим.



4. Чем отличается текстовый файл от бинарного

Текстовый файл содержит только символы, которые можно прочитать глазами — буквы, цифры, знаки препинания. Каждая строка обычно заканчивается специальным символом перевода строки. Такие файлы легко открыть в Блокноте.

Бинарный файл содержит данные в том же виде, в каком они хранятся в памяти компьютера — байтами. Если открыть бинарный файл в Блокноте, будет "каша" из непонятных символов. Зато бинарные файлы занимают меньше места и работают быстрее, потому что не нужно преобразовывать числа в текст и обратно.



5. Что делают функции putc и getc

putc — записывает один символ в файл. Например, putc('A', file) запишет букву A.
getc — читает один символ из файла. Возвращает прочитанный символ или специальное значение EOF, если файл закончился.

Это самые простые функции для работы с файлами посимвольно. Они полезны, когда нужно обработать файл побайтово или скопировать его.



6. Что делают fgets и fputs

fputs — записывает целую строку в файл. Просто берёт строку из памяти и отправляет её в файл. Символ перевода строки не добавляется автоматически.

fgets — читает строку из файла, но с ограничением: можно указать максимальное количество символов, чтобы не переполнить буфер. Она читает до тех пор, пока не встретит перевод строки или не закончится файл, и автоматически добавляет в конец строки символ конца строки '\0'. Это безопаснее, чем get



7. Что делают fprintf и fscanf

fprintf — работает точно как printf, только выводит не на экран, а в файл. Можно выводить числа, строки, символы с форматированием: fprintf(file, "Возраст: %d", age).

fscanf — работает как scanf, только читает не с клавиатуры, а из файла. Позволяет прочитать число, строку и т.д. по формату: fscanf(file, "%d", &age).

Очень удобны, когда в файле данные хранятся в понятном текстовом виде.



8. Что делают fread и fwrite

fwrite — записывает в файл блок данных так, как они лежат в памяти. Например, можно записать целый массив или структуру за один раз. Нужно указать: что записывать, размер одного элемента, сколько элементов и куда.

fread — читает блок данных из файла прямо в память. Позволяет загрузить массив или структуру целиком, без поэлементного чтения.

Эти функции используются в основном для бинарных файлов, потому что они работают с "сырыми" байтами.



9. Что делают fseek и ftell

fseek — перемещает "курсор" чтения/записи внутри файла в нужное место. Можно перемотать в начало, в конец или на определённое количество байт от текущей позиции. Например, чтобы прочитать файл с середины.

ftell — показывает, на каком месте сейчас находится курсор. Полезно, когда нужно запомнить позицию, чтобы потом вернуться к ней.

Вместе они позволяют прыгать по файлу туда-сюда, не читая всё подряд.



10. Что делают feof и ferror

feof — проверяет, дошёл ли курсор до конца файла. Возвращает ненулевое значение, если конец файла достигнут. Используется, когда нужно точно знать, что файл закончился, а не просто случилась ошибка.

ferror — проверяет, произошла ли ошибка при работе с файлом (например, диск сломался или закончилось место). Если ошибка была, функция вернёт ненулевое значение.

Они помогают отличить нормальное завершение файла от аварийной ситуации.



11. Почему важно закрывать файл

Во-первых, когда программа что-то записывает в файл, данные часто не попадают сразу на диск, а копятся в специальном буфере в памяти. При закрытии файла функцией fclose все данные гарантированно сбрасываются на диск. Если программу неожиданно выключить, часть данных может потеряться.

Во-вторых, у операционной системы есть ограничение — нельзя открыть слишком много файлов одновременно. Каждый открытый и не закрытый файл занимает ресурсы. Если постоянно открывать и не закрывать, рано или поздно программа не сможет открыть новый файл.

В-третьих, это хорошая привычка, которая помогает избегать трудноуловимых ошибок. Закрыл файл — сразу всё стало понятно и надёжно.